---
kind: method
id: M:Autodesk.Revit.DB.CurveArrayIterator.#ctor
source: html/9527239b-9de3-3e24-124a-5aba4f8dfd9a.htm
---
# Autodesk.Revit.DB.CurveArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public CurveArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.